In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn

In [2]:
file1="E:\\Naresh IT\\Sample\\Visadataset.csv"
visa=pd.read_csv(file1)

In [60]:
a1=dict(visa.dtypes)
num11=[]
cat11=[]
for key,values in a1.items():
    if values=='O':
        cat11.append(key)
    elif values!='O':
        num11.append(key)

In [5]:
sam1=dict(visa.dtypes)
cat12=[]
num12=[]
for key,value in sam1.items():
    if value=='O':
        cat12.append(key)
    elif value!='object':
        num12.append(key)
        
cat12

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'region_of_employment',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [38]:
visa['case_status'].unique()

array(['Denied', 'Certified'], dtype=object)

In [39]:
dict1={'Denied':0,'Certified':1}

In [40]:
visa['case_status']=visa['case_status'].map(dict1)
visa.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,0
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,1
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,0
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,0
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,1

In [41]:
visa.shape

(25480, 12)

In [42]:
list1=[i for i in range(25480)]

In [43]:
visa['sampale']=list1

In [69]:
visa.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,0
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,1
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,0
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,0
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,1

In [68]:
visa.drop('sampale',axis=1,inplace=True)

KeyError: "['sampale'] not found in axis"

In [84]:
visa['full_time_position'].unique()
dict11={'Y':0,'N':1}

In [87]:
visa['full_time_position']=visa['full_time_position'].map(dict11)

In [74]:
visa.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,0
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,1
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,0
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,0
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,1

In [ ]:
list1=['RAm','Legs','MEg']
list2=[1,2,3]

In [36]:
file1="E:\\Naresh IT\\Sample\\Visadataset.csv"
visa=pd.read_csv(file1)
keys=visa['case_status'].unique()
val=[i for i in range(len(keys))]
for k,l in(zip(keys,val)):
    print(dict(k,l))

TypeError: dict expected at most 1 argument, got 2

In [73]:
file1="E:\\Naresh IT\\Sample\\Visadataset.csv"
visa=pd.read_csv(file1)
visa['case_status']=np.where(visa['case_status']=='Denied',0,1)

In [75]:
file1="E:\\Naresh IT\\Sample\\Visadataset.csv"
visa=pd.read_csv(file1)
visa.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [118]:
visa['education_of_employee'].unique()

array(['High School', "Master's", "Bachelor's", 'Doctorate'], dtype=object)

In [6]:
pd.get_dummies(visa['education_of_employee'])

       Bachelor's  Doctorate  High School  Master's
0               0          0            1         0
1               0          0            0         1
2               1          0            0         0
3               1          0            0         0
4               0          0            0         1
...           ...        ...          ...       ...
25475           1          0            0         0
25476           0          0            1         0
25477           0          0            0         1
25478           0          0            0         1
25479           1          0            0         0

[25480 rows x 4 columns]

In [28]:
visa.loc[[100,200],['yr_of_estab']]

     yr_of_estab
100         2007
200         1979

In [32]:
visa.iloc[:1000,2:4]

    education_of_employee has_job_experience
0             High School                  N
1                Master's                  Y
2              Bachelor's                  N
3              Bachelor's                  N
4                Master's                  Y
..                    ...                ...
995              Master's                  N
996              Master's                  N
997            Bachelor's                  Y
998           High School                  Y
999             Doctorate                  N

[1000 rows x 2 columns]

In [6]:
list1 = ['RAm', 'Legs', 'MEg']
list2 = [1, 2, 3, 4, 5]
dict1={list1[i]:list2[i] for i in range (len(list1))}

my_dict = dict(zip(list1, list2))

print(my_dict)
print(dict1)

{'RAm': 1, 'Legs': 2, 'MEg': 3}
{'RAm': 1, 'Legs': 2, 'MEg': 3}

In [ ]:
file1="E:\\Naresh IT\\Sample\\Visadataset.csv"
visa=pd.read_csv(file1)

In [7]:
visa['case_status'].unique()

array(['Denied', 'Certified'], dtype=object)

In [8]:
pd.get_dummies(visa['case_status'])

       Certified  Denied
0              0       1
1              1       0
2              0       1
3              0       1
4              1       0
...          ...     ...
25475          1       0
25476          1       0
25477          1       0
25478          1       0
25479          1       0

[25480 rows x 2 columns]

In [12]:
df1=pd.get_dummies(visa,columns=['case_status'])

In [13]:
df1.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status_Certified', 'case_status_Denied'],
      dtype='object')

In [16]:
len(cat11)

9

In [17]:
cat11[1:]

['continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'region_of_employment',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [20]:
visa['continent'].unique()

array(['Asia', 'Africa', 'North America', 'Europe', 'South America',
       'Oceania'], dtype=object)

In [30]:
s=0
for i in cat11[1:]:
    a=visa[i].nunique()
    s+=a
    print(a)
    
s

6
4
2
2
5
4
2
2

27

In [ ]:
visa.lab

In [36]:
keys=visa['continent'].unique()
val=[i for i in range(len(keys))]
d={keys[i]:val[i] for i in range(len(keys))}

#visa['continent'].map(d)

{'Asia': 0,
 'Africa': 1,
 'North America': 2,
 'Europe': 3,
 'South America': 4,
 'Oceania': 5}

In [67]:
file1="E:\\Naresh IT\\Sample\\Visadataset.csv"
visa=pd.read_csv(file1)

In [68]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
visa['continent']=le.fit_transform(visa['continent'])
visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,1,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,1,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,1,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,0,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,1,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,1,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,1,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,1,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [44]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
visa['education_123']=le.fit_transform(visa['education_of_employee'])
visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status,education_123
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied,2
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified,3
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied,0
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied,0
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified,0
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified,2
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified,3
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified,3
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified,0

In [69]:
le.inverse_transform(visa['continent'])

array(['Asia', 'Asia', 'Asia', ..., 'Asia', 'Asia', 'Asia'], dtype=object)

In [70]:
for i in cat11[1:]:
    visa[i]=le.fit_transform(visa[i])
visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,0